#+title: JS Terminal into your server
#+subtitle: Not secure
#+tags[]: xtermjs, docker, socketio, flyio
#+date: 2024-03-31T17:49:49
#+draft: true

#+begin_src bash :results output
node -v 
#+end_src

#+RESULTS:
: v20.12.0

#+begin_src bash
  npm install vite express cors @xterm/xterm \
      @xterm/addon-fit socket.io socket.io-client node-pty
#+end_src

#+ATTR_HTML: :class table
| vite             | client build                    |
| @xterm/xterm     | terminal in html                |
| xterm-addon-fit  | xterm addon                     |
| socket.io-client | for vite                        |
| express          | server software                 |
| cors             | express cors middlewhere        |
| socket.io        | sockers on the server           |
| node-pty         | pseudo terminal on the app side |

